-- Очистим таблицы (если тестовые данные)
TRUNCATE TABLE bookings RESTART IDENTITY CASCADE;
TRUNCATE TABLE services RESTART IDENTITY CASCADE;

-- Добавляем услуги
INSERT INTO services (name, duration, work_start, work_end, created_at, updated_at) VALUES
('Поездка на квадроцикле (30 минут)', 30, '10:00:00', '20:00:00', NOW(), NOW()),
('Поездка на квадроцикле (60 минут)', 60, '10:00:00', '20:00:00', NOW(), NOW()),
('Тур на эндуро (60 минут)', 60, '10:00:00', '20:00:00', NOW(), NOW()),
('Тур на эндуро (120 минут)', 120, '10:00:00', '20:00:00', NOW(), NOW());

-- Добавляем занятые слоты
INSERT INTO bookings (service_id, name, phone, date, start_time, end_time, created_at, updated_at)
VALUES
-- Поездка на квадроцикле (30 минут) - id=1
(1, 'Иван', '+79991112233', '2025-10-16', '13:00:00', '13:30:00', NOW(), NOW()),
(1, 'Мария', '+79993334455', '2025-10-16', '16:00:00', '16:30:00', NOW(), NOW()),
(1, 'Олег', '+79995556677', '2025-10-17', '10:00:00', '10:30:00', NOW(), NOW()),
(1, 'Анна', '+79997778899', '2025-10-17', '11:00:00', '11:30:00', NOW(), NOW()),
(1, 'Павел', '+79990001122', '2025-10-17', '13:00:00', '13:30:00', NOW(), NOW()),
(1, 'Светлана', '+79992223344', '2025-10-17', '18:00:00', '18:30:00', NOW(), NOW()),

-- Поездка на квадроцикле (60 минут) - id=2
(2, 'Артём', '+79996667788', '2025-10-16', '10:00:00', '11:00:00', NOW(), NOW()),

-- Тур на эндуро (60 минут) - id=3
(3, 'Кирилл', '+79998889900', '2025-10-16', '10:00:00', '11:00:00', NOW(), NOW()),
(3, 'Алексей', '+79997776655', '2025-10-16', '11:30:00', '12:30:00', NOW(), NOW()),
(3, 'Марина', '+79990002211', '2025-10-16', '18:30:00', '19:30:00', NOW(), NOW()),

-- Тур на эндуро (120 минут) - id=4
(4, 'Сергей', '+79991110022', '2025-10-17', '14:00:00', '16:00:00', NOW(), NOW());
